app/views/messages/index.html.erb

                  <h5 class="handle"><%= message.user.name %></h5>
                  <% unless message.user.followers.include?(current_user) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]