app/controllers/messages_controller.rb

	def index
    @messages = Message.order('created_at DESC').page(params[:page])
---
SELECT  "messages".* FROM "messages"  ORDER BY created_at DESC LIMIT 7 OFFSET 0
SELECT COUNT(*) FROM "messages"